МП/src/Catalogs/ЭлементыДоски/ЭлементыДоски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыДоски</name>
  <owners>Catalog.Разделы</owners>
  <attributes>
    <name>ПапкаДляХраненияФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

МП/src/InformationRegisters/Напоминания/Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Напоминания</name>
  <resources>
    <name>ДатаНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНапоминания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзначальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/InformationRegisters/ПорядокЭлементовВРазделах/ПорядокЭлементовВРазделах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокЭлементовВРазделах</name>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/Catalogs/ЭлементыДоски/ObjectModule.bsl
Процедура ПередУдалением(Отказ)//Ден  2016 10 11 ---
	НаборЗап = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
	НаборЗап.Записывать = истина;
	НаборЗап.Отбор.Элемент.Установить(Ссылка);	
	НаборЗап.Прочитать();
	Если НаборЗап.Количество() Тогда
		ОбщийВызовСервера.ЗаписатьНовоеЗначениеКонстанты("ПерезаписатьНапоминания",истина);
		НаборЗап.Очистить();
		НаборЗап.Записать();
	КонецЕсли;
	
	МенЗап = РегистрыСведений.ПорядокЭлементовВРазделах.СоздатьМенеджерЗаписи();
	МенЗап.Элемент = Ссылка;
	МенЗап.Удалить();
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)//Ден  2016 10 11 ---
	попытка
	Если Ссылка.Пустая() Тогда
		нСсылка = справочники.ЭлементыДоски.ПолучитьСсылку();
		УстановитьСсылкуНового(нСсылка);
	КонецЕсли;          
	МенЗап = РегистрыСведений.ПорядокЭлементовВРазделах.СоздатьМенеджерЗаписи();
	МенЗап.Элемент = Ссылка;
	МенЗап.Прочитать();
	Если МенЗап.Порядок = 0 Тогда
		МенЗап.Элемент = Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ПорядокЭлементовВразделах.Порядок), 0) КАК Порядок
		|ИЗ
		|	РегистрСведений.ПорядокЭлементовВразделах КАК ПорядокЭлементовВразделах
		|ГДЕ
		|	ПорядокЭлементовВразделах.Элемент.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда
			последнийНомер = ВыборкаЗапроса.Порядок;	
		иначе
			последнийНомер = 0;	
		КонецЕсли;
		МенЗап.Порядок = последнийНомер + 1;
		МенЗап.Записать();
	КонецЕсли;
исключение
	сообщить("Ошибка в модуле объекта");
		сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
